HighwayStar/c606-oss/sdkconfig.defaults
# Magene C606: ESP32-S3, 16 MB flash, DIO @ 80 MHz (matches vendor app header)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# We flash only the app into the vendor's existing ota_0 slot; this table is
# only used to size-check the build (see tools/flash_poc.py).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM: esptool reports "Embedded PSRAM 2MB (AP_3v3)" -> quad mode.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# LVGL 9 (managed component lvgl/lvgl). Objects go through malloc(), so
# anything >4 KB lands in PSRAM; draw buffers are allocated explicitly in
# internal DMA RAM by ui_port.c.
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_COLOR_FORMAT_RGB565=y
CONFIG_LV_DEF_REFR_PERIOD=33
CONFIG_LV_DPI_DEF=130
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_UNSCII_8=y
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y
CONFIG_LV_LOG_PRINTF=y

# Logs over the S3's built-in USB-Serial-JTAG (USB-C on the device, /dev/ttyACM0).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Reduce boot-time verbosity a bit, keep info logs
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y

CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# eMMC/FAT: the vendor uses long file names (NAVIGATION/, EPHEMERIS/, *.fit)
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y

# TinyUSB mass storage (esp_tinyusb): exposes the eMMC on demand (hold key 1)
CONFIG_TINYUSB_MSC_ENABLED=y
CONFIG_TINYUSB_MSC_BUFSIZE=8192
CONFIG_TINYUSB_CDC_ENABLED=n
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="c606-oss"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="C606 eMMC"
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Map files are 100+ MB and read with random seeks: the cluster link map
# makes f_lseek O(1) instead of walking the FAT chain from the file start.
CONFIG_FATFS_USE_FASTSEEK=y
CONFIG_FATFS_FAST_SEEK_BUFFER_SIZE=512
